#+startup: beamer
#+title: Advanced mixed-models workshop: Session 2
#+author: Dale Barr
#+email: dale.barr@glasgow.ac.uk
#+date: Bremen March 2015
#+OPTIONS: toc:nil H:2 ^:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: []
#+BEAMER_THEME: Boadilla
#+LATEX_HEADER: \makeatletter \def\verbatim{\scriptsize\@verbatim \frenchspacing\@vobeyspaces \@xverbatim} \makeatother

#+BEAMER_COLOR_THEME: seahorse
#+LATEX_HEADER: \definecolor{lgray}{rgb}{0.90,0.90,0.90}
#+LATEX_HEADER: \beamertemplatenavigationsymbolsempty
#+LATEX_HEADER: \usemintedstyle{tango}
#+LATEX_HEADER: \institute{University of Glasgow}

#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+PROPERTY: header-args:R :session *R* :exports both :results output verbatim :tangle session_02.R

** Run t-test (aggregating first by subject)

#+BEGIN_SRC R
  # re-create data: t-test
  dat.subj <- aggregate(tfixTrunc ~ SubjID + cond, dat, mean)
  dat.subj <- dat.subj[order(dat.subj$SubjID, dat.subj$cond), ]

  dat.t <- t.test(subset(dat.subj, cond=="C")$tfixTrunc,
                  subset(dat.subj, cond=="E")$tfixTrunc, paired=TRUE)
  print(dat.t)
#+END_SRC

#+RESULTS:
#+begin_example

	Paired t-test

data:  subset(dat.subj, cond == "C")$tfixTrunc and subset(dat.subj, cond == "E")$tfixTrunc
t = -4.3608, df = 19, p-value = 0.0003364
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -2129.4142  -748.2524
sample estimates:
mean of the differences 
              -1438.833
#+end_example

** View results

#+BEGIN_SRC R :exports results :eval never
  print(summary(mod1), correlation = FALSE)
#+END_SRC

#+RESULTS:
#+begin_example
Linear mixed model fit by maximum likelihood  ['lmerMod']
Formula: tfixTrunc ~ C2 + (1 + C2 | SubjID) + (1 + C2 | object)
   Data: dat
 Subset: complete.cases(dat)

     AIC      BIC   logLik deviance df.resid 
  4421.9   4453.0  -2201.9   4403.9      226 

Random effects:
 Groups   Name        Variance Std.Dev. Corr
 SubjID   (Intercept)  417282   645.97      
          C2           758341   870.83  1.00
 object   (Intercept)  616982   785.48      
          C2             6765    82.25  1.00
 Residual             7236631  2690.10      
Number of obs: 235, groups:  SubjID, 20; object, 12

Fixed effects:
            Estimate Std. Error t value
(Intercept)   3306.4      321.1  10.296
C2            1439.6      402.2   3.579
#+end_example

** Additional stats

#+begin_src R :cache yes
  library("pbkrtest")

  mod_kr <- KRmodcomp(mod1, mod2)

  summary(mod_kr)
#+end_src

#+RESULTS[a21201dd2704288fcddacb9041b2d895bd722e63]:
: F-test with Kenward-Roger approximation; computing time: 1.14 sec.
: large : tfixTrunc ~ C2 + (1 + C2 | SubjID) + (1 + C2 | object)
: small : tfixTrunc ~ (1 + C2 | SubjID) + (1 + C2 | object)
:           stat     ndf     ddf F.scaling  p.value   
: Ftest  12.4550  1.0000  8.9771         1 0.006448 **
: FtestU 12.4550  1.0000  8.9771           0.006448 **
: ---
: Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

** Parametric bootstrap

#+BEGIN_SRC R :cache yes
  mod_pb <- PBmodcomp(mod1, mod2)

  summary(mod_pb)
#+END_SRC

#+RESULTS[3013bd824fc4a56fb33c20466b86fd7e9944571c]:
#+begin_example
There were 50 or more warnings (use warnings() to see the first 50)
Parametric bootstrap test; time: 156.28 sec; samples: 1000 extremes: 0;
Requested samples: 1000 Used samples: 996 Extremes: 0
large : tfixTrunc ~ C2 + (1 + C2 | SubjID) + (1 + C2 | object)
small : tfixTrunc ~ (1 + C2 | SubjID) + (1 + C2 | object)
           stat     df     ddf   p.value    
PBtest   10.539                0.0010030 ** 
Gamma    10.539                0.0005716 ***
Bartlett 11.161  1.000         0.0008356 ***
F        10.539  1.000 -33.912              
LRT      10.539  1.000         0.0011689 ** 
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Warning message:
In pf(Fobs, df1 = ndf, df2 = ddf) : NaNs produced
#+end_example

